_protected/views/mesa/index.php

                return $model->boda->id;
            },
            'filterType' => GridView::FILTER_SELECT2,
            'filter' => \yii\helpers\ArrayHelper::map(\app\models\Boda::find()->asArray()->all(), 'id', 'id'),
---
SELECT * FROM `boda`