_protected/views/mesa-invitado/_form.php

SELECT * FROM `invitado` ORDER BY `id`
---
        ],
    ]); ?>

    <?= $form->field($model, 'id_invitado')->widget(\kartik\widgets\Select2::classname(), [
        'data' => \yii\helpers\ArrayHelper::map(\app\models\Invitado::find()->orderBy('id')->asArray()->all(), 'id', 'id'),
        'options' => ['placeholder' => 'Choose Invitado'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ]); ?>