_protected/controllers/InvitadoController.php

SELECT COUNT(*) FROM `invitado` WHERE `id_confirmacion`='0'
SELECT COUNT(*) FROM `invitado` WHERE `id_confirmacion`='1'
SELECT COUNT(*) FROM `invitado` WHERE `id_confirmacion`='2'
SELECT COUNT(*) FROM `invitado`
---
    public function actionIndex($tipo_invitado = 3)
    {

        $searchModel = new InvitadoSearch();
        $searchModel->id_boda = 1;
        if($tipo_invitado == 3)
            $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        else{
            $searchModel->id_confirmacion = $tipo_invitado;
            $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        }
        $sin_confirmar = Invitado::find()->where(['id_confirmacion' => '0'])->count();
        $confirmados = Invitado::find()->where(['id_confirmacion' => '1'])->count();
        $no_iran = Invitado::find()->where(['id_confirmacion' => '2'])->count();
        $todos = Invitado::find()->count();