_protected/models/ConfirmacionQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `confirmacion`

    public function one($db = null)
    {
        return parent::one($db);
---
SELECT * FROM `confirmacion` WHERE 0=1