_protected/models/MesaQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `mesa` ORDER BY `id`